Tekla Open API Reference for Tekla Structures 2025
BoltGroup.BoltHolesAttributes Property
 The bolt holes attributes.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public IList<BoltHoleAttributes> BoltHolesAttributes { get; set; }
Public Property BoltHolesAttributes As IList(Of BoltHoleAttributes)
	Get
	Set
Property Value
Type: IList<BoltHoleAttributes>
See Also
Reference
BoltGroup Class
Tekla.Structures.Model Namespace